---
kind: property
id: P:Autodesk.Revit.DB.SlabShapeVertex.VertexType
source: html/571a50f0-60b5-cab3-a8fa-368d3c18c526.htm
---
# Autodesk.Revit.DB.SlabShapeVertex.VertexType Property

The vertex type

## Syntax (C#)
```csharp
public SlabShapeVertexType VertexType { get; }
```